import {type ITimeLapse} from "../types";

export const TimeLapse: ITimeLapse[] = [
   {
      id: 1,
      nameTime: 'Музыка',
      yearStart: 1981,
      yearEnd: 1986,
      events: [
         {
            id: 1,
            eventYear: 1981,
            eventDescription: `«Грэмми» за альбом года — Джон Леннон и Йоко Оно за «Double Fantasy»`
         },
         {
            id: 2,
            eventYear: 1982,
            eventDescription: `5 ноября — Первый выпуск музыкальной программы «The Tube» показан на 4-м канале центрального телевидения Соединённого Королевства.`
         },
         {
            id: 3,
            eventYear: 1983,
            eventDescription: `18 апреля — Элен Таафе Звилич стала первой женщиной-композитором получившей Пулитцеровскую премию за выдающееся музыкальное произведение.`
         },
         {
            id: 4,
            eventYear: 1984,
            eventDescription: `29 октября — В Москве на Новодевичьем кладбище состоялась церемония перезахоронения праха выдающегося русского певца Фёдора Ивановича Шаляпина, скончавшегося в Париже в 1938-м году.`
         },
         {
            id: 5,
            eventYear: 1985,
            eventDescription: `Концертная программа Валерия Леонтьева «Наедине со всеми». Вследствие очередей за билетами на нескольких центральных улицах Ленинграда останавливается транспортное движение. 10 концертов.`
         },
         {
            id: 6,
            eventYear: 1986,
            eventDescription: `28 февраля — От последствий тяжёлой формы алкоголизма скончался первый вокалист «Uriah Heep» Дэвид Байрон.`
         }
      ]
   },
   {
      id: 2,
      nameTime: 'Кино',
      yearStart: 1987,
      yearEnd: 1991,
      events: [
         {
            id: 1,
            eventYear: 1987,
            eventDescription: `«Хищник»/Predator, США (реж. Джон Мартин)`
         },
         {
            id: 2,
            eventYear: 1988,
            eventDescription: `«Кто подставил кролика Роджера»/Who Framed Rogers Rabbit, США (реж. Роберт Земекис)`
         },
         {
            id: 3,
            eventYear: 1989,
            eventDescription: `«Назад в будущее 2»/Back To The Future 2, США (реж. Роберт Земекис)`
         },
         {
            id: 5,
            eventYear: 1990,
            eventDescription: `«Крепкий орешек 2»/Die Hard 2, США (реж. Ренни Харлин)`
         },
         {
            id: 6,
            eventYear: 1991,
            eventDescription: `«На гребне волны»/Point Break, США (реж. Кэтрин Бигелоу)`
         }
      ]
   },
   {
      id: 3,
      nameTime: 'Литература',
      yearStart: 1992,
      yearEnd: 1997,
      events: [
         {
            id: 1,
            eventYear: 1992,
            eventDescription: `Нобелевская премия по литературе — Дерек Уолкотт, «За блестящий образец Карибского эпоса в 66 разделах»`
         },
         {
            id: 2,
            eventYear: 1993,
            eventDescription: `«Больше, чем огонь»/More Than Fire — роман из серии «Многоярусный мир» писателя Филипа Хосе Фармера.`
         },
         {
            id: 3,
            eventYear: 1994,
            eventDescription: `Премия Андрея Белого — категория поэзия — Шамшад Абдуллаев`
         },
         {
            id: 4,
            eventYear: 1995,
            eventDescription: `«Река, выходящая из Эдема»/River Out of Eden — книга этолога, эволюционного биолога Ричарда Докинза.`
         },
         {
            id: 5,
            eventYear: 1996,
            eventDescription: `«Бойцовский клуб»/Fight Club — роман Чака Паланика.`
         },
         {
            id: 6,
            eventYear: 1997,
            eventDescription: `«Гарри Поттер и философский камень»/Harry Potter and the Philosopher's Stone — роман Джоан Роулинг.`
         }
      ]
   },
   {
      id: 4,
      nameTime: 'Театр',
      yearStart: 1999,
      yearEnd: 2004,
      events: [
         {
            id: 1,
            eventYear: 1999,
            eventDescription: `3 апреля — премьера балета «Золушка» в постановке Жан-Кристофа Майо[en], сценография Эрнеста Пиньона (Балет Монте-Карло, Золушка — Орели Шефер[fr], Фея — Бернис Коппьетерс).`
         },
         {
            id: 2,
            eventYear: 2000,
            eventDescription: `Февраль — «Моцарт и Сальери» А. С. Пушкина в постановке А. А. Васильева, «Школа драматического искусства».`
         },
         {
            id: 3,
            eventYear: 2001,
            eventDescription: `Танцовщик Дэвид Макалистер[en] занял пост руководителя труппы «Австралийский балет».`
         },
         {
            id: 4,
            eventYear: 2002,
            eventDescription: `27 июня — премьера трилогии Тома Стоппарда «Берег Утопии», Королевский Национальный театр, Лондон`
         },
         {
            id: 5,
            eventYear: 2003,
            eventDescription: `30 мая — «Вий» по повести Н. В. Гоголя, Московский драматический театр имени А. С. Пушкина`
         },
         {
            id: 6,
            eventYear: 2004,
            eventDescription: `2 октября в Московском драматическом театре им. А. С. Пушкина поставлен спектакль «Кот в сапогах» Ш.Перро.`
         }
      ]
   },
   {
      id: 5,
      nameTime: 'Спорт',
      yearStart: 2006,
      yearEnd: 2013,
      events: [
         {
            id: 1,
            eventYear: 2006,
            eventDescription: `Баскетбольный клуб ЦСКА стал победителем национального первенства России.`
         },
         {
            id: 2,
            eventYear: 2007,
            eventDescription: `Теннис — Россия выиграла Кубок Хопмана, обыграв в финале Испанию с общим счётом 2:1.`
         },
         {
            id: 3,
            eventYear: 2008,
            eventDescription: `Московский ЦСКА стал победителем Евролиги 2007/2008.`
         },
         {
            id: 4,
            eventYear: 2010,
            eventDescription: `20 апреля — 2 мая в Баку: Чемпионат мира по боксу среди молодёжи 2010.`
         },
         {
            id: 5,
            eventYear: 2012,
            eventDescription: `Французский биатлонист Мартен Фуркад стал победителем индивидуальной гонки на 20 км на этапе Кубка мира в Эстерсунде.`
         },
         {
            id: 6,
            eventYear: 2014,
            eventDescription: `Мужская сборная России по кёрлингу дебютировала на Олимпиаде. Одержав три победы в девяти матчах, команда заняла седьмое место. Женская команда стала девятой.`
         }
      ]
   },
   {
      id: 6,
      nameTime: 'Наука',
      yearStart: 2015,
      yearEnd: 2022,
      events: [
         {
            id: 1,
            eventYear: 2015,
            eventDescription: `13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды`
         },
         {
            id: 2,
            eventYear: 2016,
            eventDescription: `Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11`
         },
         {
            id: 3,
            eventYear: 2017,
            eventDescription: `Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi`
         },
         {
            id: 4,
            eventYear: 2018,
            eventDescription: `13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды`
         },
         {
            id: 5,
            eventYear: 2019,
            eventDescription: `Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11`
         },
         {
            id: 6,
            eventYear: 2020,
            eventDescription: `Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi`
         }
      ]
   }
]
